package jp.co.navitime.j03.p01;

/*
 * 以下の要件を満たす社員クラス Employee を作成する.
 *
 * - 社員は入社年月日をプロパティとしてもつ.
 * - 社員は入社年月日をコンストラクタで受け取り, インスタンス化される.
 * - 社員は「年月日を渡すと, その日時点で勤続何年目を返す」メソッドをもつ.
 *   なお, 月日が同じ場合は, 1 年経過したものとみなす.
 *   つまり, 2017/04/01 入社の社員は, 2018/04/01 には入社 2 年目である.
 *
 * これを単体テストとともに作成するため, 以下の手順に従って実装せよ.
 *
 * 1. Employee の空実装を作成せよ.
 *    このとき, メソッド定義だけを行い, 実装は空にしておく.
 *    すなわち, コンストラクタでは何もせず,
 *    勤続年数を問うメソッドは定数値を返すことにする.
 * 2. 社員クラスが正しく動作すると仮定して, 単体テストクラス EmployeeTest を実装せよ.
 *    このとき, テストは失敗してもよい.
 * 3. テストが成功するように, Employee を実装せよ.
 */
public class Main {
}
