package jp.co.navitime.j01.p10;

/*
 * 1. 下記地点の2点間の距離に応じて料金を計算する static メソッド calcFare() を作成せよ。
 *
 *   | 地点 | 座標     |
 *   |------|----------|
 *   | A    | (10, 20) |
 *   | B    | (10, 22) |
 *   | C    | (15, 40) |
 *   | D    | (40, 20) |
 *
 *   | 距離                      | 料金    |
 *   |---------------------------|---------|
 *   | 10.0 km 未満              |  300 円 |
 *   | 10.0 km 以上 30.0 km 未満 |  500 円 |
 *   | 30.0 km 以上              | 1000 円 |
 *
 * 2. A-B 間、A-C 間、A-D 間の料金を求めよ。
 */

public class Main {

    public static void main(String[] args) {
    }
}
