package jp.co.navitime.j05.p01;

/*
 * コンビニ経営を行う.
 * コンビニは以下の要件を満たす.
 *
 * 1. コンビニは店舗名称がひとつある.
 * 2. コンビニは商品棚がひとつある.
 * 3. 商品棚は複数種類の商品を格納できる.
 * 4. 商品には名前と価格が決められている.
 * 5. コンビニは従業員が複数いる.
 * 6. 従業員は名前がある.
 * 7. 従業員は商品棚から商品を取り出し, 販売できる.
 * 8. 従業員は商品棚に商品を追加できる.
 *
 * ユースケースとして, 以下を画面表示で確認できることとする.
 *
 * - コンビニ店舗「港店」を用意する.
 * - 従業員「java」を用意する.
 * - 従業員「java」が商品棚に商品「おにぎり」を追加する.
 * - 商品棚にある商品の商品名と価格の一覧を表示する.
 * - 従業員「java」が商品「おにぎり」を販売する.
 * - 商品棚に商品がないことを表示する.
 *
 * 以上を踏まえ, 以下を実装せよ.
 *
 * - コンビニ経営を実施するためのクラス
 * - 作成したクラスの動作を確認する単体テスト
 * - ユースケースを確認できる Main メソッド
 */
public class Main {

    public static void main(String[] args) {
    }
}
